{
  "title": "Customer Spotlight",
  "url": "https://www.boostly.com/blog/customer-spotlight-renegade-burrito",
  "dateText": null,
  "excerpt": "February 1, 2024",
  "id": "customer-spotlight-renegade-burrito",
  "content": {
    "title": "Customer Spotlight",
    "fullText": "<iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-TK46DZVS\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>\n\n    \n    Customer SpotlightCustomer Spotlight: Renegade BurritoBoostly•Feb 1, 2024Location: ColoradoFounded: 2017Type: Fast casual restaurant serving Tex-MexIn 2017, Denver witnessed the birth of Renegade Burrito, a venture that swiftly ascended to the apex of the city's culinary scene.Brad and Tiffani Harris, alongside Brenda and Lenny Garner, embarked on a journey that transitioned from franchise operation to establishing an award-winning independent restaurant. “I started my restaurant career working at a Subway sandwich shop while attending the University of Northern Colorado,” Harris recalls. “Fast-forward 30 years, and my wife and I have owned 35 Subway locations as well as 10 more franchise locations across seven other regional and national brands.”“But something was missing,” says Harris.And that \"something\" gave birth to a new concept that focused on sustainability, unit profitability, and a memorable brand experience that is often missing from franchise concepts. The accolades soon followed, with Renegade Burrito being lauded for its exceptional breakfast burritos, tacos, and overall excellence in Tex-Mex cuisine.“A successful business provides a high-quality product or service at a fair price,” Harris says. “This has been the key to Renegade’s success and can be shown through numerous awards, growing sales, and profitability increases—as well as high Google and Yelp ratings.” Renegade levels up it's digital strategy with partners ChowNow and BoostlyA great product is foundational to any company's success, and Renegade nailed their product early on. But the issues that often plague restaurant owners—even those with amazing food—is how to market their goods and take advantage of the digital channels that today's consumer prefers while maintaining a healthy profit margin.  This is where ChowNow and Boostly made all the difference.By turning to ChowNow for a branded app, Renegade was able to realize a 167% increase in average orders thanks to zero commission orders—avoiding the hefty fees incurred by expensive platforms like DoorDash, Uber Eats & Grub Hub. Using the ChowNow Pro suite of marketing tools, they were also able to leverage their own data and drive customer loyalty in ways that those other apps just aren't able to.Next, Renegade looked to Boostly to drive more orders, sales and reviews through text marketing. By leveraging the ChowNow X Boostly integration to send text marketing campaigns with personalized text offers and updates directly to diners’ phones, Renegade saw a 17X return on investment.Their next text campaign helped them build up their Google reviews, driving 89 five-star reviews in a matter of days.  The best part? Boostly's dedicated marketing specialists were there every step of the way to do all the heavy lifting for Renegade Burrito, from suggesting offers to creating and sending the text campaigns and even measuring the impact.For Harris, having access to customer data was the biggest advantage. “Other ordering platforms keep customer data to themselves and won’t share it with restaurants,” he says. “With ChowNow, the customer data is mine, and I can use it to market to my customers and know who they are. The ChowNow and Boostly integration goes beyond just orders. It creates a smooth and unified experience, a positive customer journey that keeps diners engaged and coming back to us.”“Previously, my databases didn’t interact,” Harris says. “I’d have to download my ChowNow data on a regular basis and send the Excel file to my previous text marketing company. This process was cumbersome and painful. Now that the databases are integrated, it’s seamless and happens in real time.”The journey of Renegade Burrito is more than a success story; it's a blueprint for the future of dining. It highlights the transformative power of technology when leveraged strategically, setting a benchmark for others in the industry to follow and serves a reminder that by owning the customer journey with tools like ChowNow and Boostly, any restaurant can write their own success story.A look at the numbers:6X increase in orders with their branded mobile apps21% more orders after adding images to their online menu167% increase in average orders by enabling Flex Delivery31% more orders after turning on automated emails17X return on investment in a single text campaign89 new five-star Google reviews30.5% engagement rate on a single textWant to leverage the power of Boostly X ChowNow for your restaurant?  Chat with one of our marketing specialists today!Ready to See Boostly in Action?See how you can get more orders, reviews and customer loyalty without lifting a finger.Get Free Demo© 2025 Boostly. All rights reserved.SitemapHow it WorksReviewsCareersTerms of ServiceCompany Terms of UsePrivacyContactsales@boostly.com(800) 720-7738(()=>{function u(){function n(t,e,i)",
    "paragraphs": [
      "In 2017, Denver witnessed the birth of Renegade Burrito, a venture that swiftly ascended to the apex of the city's culinary scene.",
      "Brad and Tiffani Harris, alongside Brenda and Lenny Garner, embarked on a journey that transitioned from franchise operation to establishing an award-winning independent restaurant.",
      "“I started my restaurant career working at a Subway sandwich shop while attending the University of Northern Colorado,” Harris recalls. “Fast-forward 30 years, and my wife and I have owned 35 Subway locations as well as 10 more franchise locations across seven other regional and national brands.”",
      "“But something was missing,” says Harris.",
      "And that \"something\" gave birth to a new concept that focused on sustainability, unit profitability, and a memorable brand experience that is often missing from franchise concepts.",
      "The accolades soon followed, with Renegade Burrito being lauded for its exceptional breakfast burritos, tacos, and overall excellence in Tex-Mex cuisine.",
      "“A successful business provides a high-quality product or service at a fair price,” Harris says. “This has been the key to Renegade’s success and can be shown through numerous awards, growing sales, and profitability increases—as well as high Google and Yelp ratings.”",
      "A great product is foundational to any company's success, and Renegade nailed their product early on. But the issues that often plague restaurant owners—even those with amazing food—is how to market their goods and take advantage of the digital channels that today's consumer prefers while maintaining a healthy profit margin.  This is where ChowNow and Boostly made all the difference.",
      "By turning to ChowNow for a branded app, Renegade was able to realize a 167% increase in average orders thanks to zero commission orders—avoiding the hefty fees incurred by expensive platforms like DoorDash, Uber Eats & Grub Hub. Using the ChowNow Pro suite of marketing tools, they were also able to leverage their own data and drive customer loyalty in ways that those other apps just aren't able to.",
      "Next, Renegade looked to Boostly to drive more orders, sales and reviews through text marketing. By leveraging the ChowNow X Boostly integration to send text marketing campaigns with personalized text offers and updates directly to diners’ phones, Renegade saw a 17X return on investment."
    ],
    "images": [
      {
        "src": "https://framerusercontent.com/images/caIhwh1ahdNTbRUBH6hhsd9UIlI.jpeg",
        "alt": "Customer Spotlight: Renegade Burrito"
      }
    ],
    "wordCount": 1253
  },
  "scrapedAt": "2025-06-19T21:29:58.014Z"
}